Satoru-Kutsuwada/PIC-18F47J53_vl53l0x/PIC18F47J53.X/debug_main.c
#include "main.h"				
#include "system.h"				
#include <xc.h>		

#include <stdio.h>
#include <stdbool.h>
#include <stdarg.h>
#include <ctype.h>
#include <string.h>

#include "debug_main.h"
#include "rtc_main.h"

char CharConv[16]={
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
    'a', 'b', 'c', 'd', 'e', 'f'
};


void RegiDisp(void);
void uart_start_dispg(void);
void debug_main(void);
void rtc_disp_log(uint8_t flg);
void uint2string(char *buf, uint16_t data, uint8_t flg,uint8_t keta);
uint8_t get_log_onoff(void);


//extern void putrsUSBUSART(const char *data);
extern void putsUSBUSART(char *data);
extern void CDCTxService(void);
extern void Wait2Connect(void);
extern void Wait2TxRedy(void);
extern void CDCTxService22(void);
extern void Test_Set_timer(void);
extern void RTCdisp(void);
//extern void vl53l0x_test(void);
extern void VL53_init(void);
extern char IntgetChar(void);
extern void i2c_init(uint8_t sel);
extern uint8_t get_rtc_usec(void);            
extern uint8_t get_rtc_sec(void);
extern uint16_t get_rtc_msec(void);        
//extern void vl53l0x_Single_test(void);
//extern void vl53l0x_SingleHA_test(void);
//extern void vl53l0x_SingleHS_test(void);
//extern void vl53l0x_SingleLR_test(void);
extern void putch485(char c);
extern void print485(char *string);

extern void vl53data_disp(void);
extern void vl53l0x_Racing_test(RASING_MODE sel);

void DispLogData(void);
void SetLogData(uint8_t type, char *string, uint8_t dt1, uint8_t dt2, uint8_t dt3,uint8_t dt4);
void SetSubStringData( char *cpt, uint16_t *dpt );

//=============================================================================
// 変数宣言
//=============================================================================
uint16_t i2c_sens_cnt = 0;
uint8_t log_sem = 0;
uint8_t log_onoff = 0;
uint8_t log_stop = 0;

INPUT_CHAR_STEP input_char_step = INPUT_INIT;

typedef struct{
char main[INPUT_BUF_SIZE];
char sub1[INPUT_BUF_SIZE/2];
char sub2[INPUT_BUF_SIZE/2];
uint16_t data1;
uint16_t data2;
}INPUT_STRING;

INPUT_STRING input_string;


int input_pos;
 typedef enum{
    DL_RTC,
    DL_REG,
    DL_I2C,        
    DL_VL53,        
    DL_PB0,        
    DL_LOG,        
    DL_LOGOFF,        
    DL_LOGON,        
    DL_LOGCLEAR,        
    DL_RS485,        
            
            
    DL_ENDPT 
 }COMMAND_MENUE;
 
#define MAX_COM_LENGTH 10
 typedef struct{
     COMMAND_MENUE pt;
     char command[MAX_COM_LENGTH];
 } COMAND_LIST;
 
 const COMAND_LIST com_list[] = {
     { DL_RTC,      "rtc"  },
     { DL_REG,      "reg" },
     { DL_I2C,      "i2c" },
     { DL_VL53,     "vl53" },
     { DL_PB0,      "pb2" },
     { DL_LOG,      "log" },
     { DL_LOGOFF,   "logoff" },
     { DL_LOGON,    "logon" },
     { DL_LOGCLEAR, "logclr" },
     { DL_RS485,    "rs485" },
     
     
     
     { DL_ENDPT, "none" }
 };
 
#define CHAR_1_RECORD_MAX 20
#define LOG_SIZE 20
 
 typedef struct{
     uint8_t type;
     uint8_t sec;
     uint16_t msec;
     uint8_t usec;
     char string[CHAR_1_RECORD_MAX];
     uint8_t reg[4];
 }LOG_RECORD;
 
 typedef struct{
     LOG_RECORD log_data[LOG_SIZE];
     uint16_t wpt;
     uint16_t rpt;
 }LOG_DATA;
 
 LOG_DATA log_dt;
 
                     
typedef enum{
    DEB_PROMPT_MODE = 0,
    DEB_VL53_MENUE,
    DEB_RS485_MENUE,
            
    DEB_DISP_MAX
} DEB_MENUE_TYPE;

DEB_MENUE_TYPE dev_menue_type = DEB_PROMPT_MODE;

  // VL53 MENUE
 #define MAX_LENGTH 30
typedef struct{
    char    name[MAX_LENGTH];
} MENUE;

const MENUE Deb_menue00[] = {
     "\r\nVL53 MENUE",
     " 1.VL53_INIT",
     " 2.CONTIIOUS RANGING",
     " 3.SINGLE RANGING",
     " 4.SINGLE RANGING HA",
     " 5.SINGLE RANGING HS",
     " 6.SINGLE RANGING LR",
     " 7.VL53 Data DISPLAY",

     " r.EXIT"
 };   
const MENUE Deb_menue01[] = {
     "\r\nRS485 MENUE",
     " 1.RX MODE",
     " 2.TX MODE",

     " r.EXIT"
 };   
 
typedef struct
{
    MENUE *pt;
    uint8_t clumn;
} MENUE_NUM_PAGE;

 const MENUE_NUM_PAGE MenueList[]={
    Deb_menue00, (uint8_t)(sizeof(Deb_menue00 )/sizeof(MENUE)),
    Deb_menue01, (uint8_t)(sizeof(Deb_menue01 )/sizeof(MENUE))
};
 
 
 
//extern  RTC_DATA RTCdt;


//-----------------------------------------------------------------------------
//4
//-----------------------------------------------------------------------------
void log_init(void)
{
    log_dt.wpt =0;     
    log_dt.rpt =0;     
}

//-----------------------------------------------------------------------------
// 
//-----------------------------------------------------------------------------


 void SetLogDataM(uint8_t type, char *string, uint8_t dt1, uint8_t dt2, uint8_t dt3,uint8_t dt4)
 {
     uint16_t i;

   if( get_log_onoff() == 2 ) {
        printf("I=%d,S=%02x,C1=%02x,C2=%02x,BF=%02x  %s\r\n",type,dt1,dt2,dt3,dt4, string);
   }
    SetLogData(type, string, dt1, dt2, dt3,dt4);
    
 }
 
 void set_log_stop(uint8_t flg)
 {
     if(flg != 0)
        SetLogData(LOG_DISP_NO_DATA ,"LOG STOP", 0,0,0,0);

        log_stop = flg;
     
 }
 
 void SetLogData(uint8_t type, char *string, uint8_t dt1, uint8_t dt2, uint8_t dt3,uint8_t dt4)
 {
     uint16_t i;

     if( log_stop != 0 )
         return;

    while(log_sem != 0);
    log_sem = 1;

     //while(RTCdt.usec==10);

     log_dt.log_data[log_dt.wpt].sec  = get_rtc_sec();
     log_dt.log_data[log_dt.wpt].msec = get_rtc_msec();
     log_dt.log_data[log_dt.wpt].usec = get_rtc_usec(); 
                

            

     log_dt.log_data[log_dt.wpt].reg[0] = dt1;
     log_dt.log_data[log_dt.wpt].reg[1] = dt2;
     log_dt.log_data[log_dt.wpt].reg[2] = dt3;
     log_dt.log_data[log_dt.wpt].reg[3] = dt4;
     log_dt.log_data[log_dt.wpt].type = type;
     
     
     
     i=0;
     while( *string != '\0' ){
        log_dt.log_data[log_dt.wpt].string[i] = *string;
        if( i > CHAR_1_RECORD_MAX ){
           log_dt.log_data[log_dt.wpt].string[i] = '\0';
           break;
        }
        i ++;
        string ++;
    } 
    log_dt.log_data[log_dt.wpt].string[i] = '\0';
     
    log_dt.wpt ++;
    if( log_dt.wpt > LOG_SIZE ){
        log_dt.wpt = 0;
    }
    
    if( log_dt.wpt == log_dt.rpt ){
        log_dt.rpt ++;
        if( log_dt.rpt > LOG_SIZE ){
            log_dt.rpt = 0;
        }
    }

