Satoru-Kutsuwada/PIC-18F47J53_vl53l0x/PIC18F47J53.X/debug_main.c
    log_sem = 0;

 }

//-----------------------------------------------------------------------------
// 
//-----------------------------------------------------------------------------

 void DispLogData(void)
 {
     uint16_t i;
     uint16_t rpt;

    printf("\r\n");

    printf("WPT=%d,RPT=%d\r\n",log_dt.wpt,log_dt.rpt);
    
    rpt = log_dt.rpt;
    for(i=0; i<  LOG_SIZE; i++ ){
     
       
        if( log_dt.log_data[rpt].usec == 10 )
            log_dt.log_data[rpt].usec = 0;

        // 時刻
        printf("%02d.%03d.%d ",  log_dt.log_data[rpt].sec,   log_dt.log_data[rpt].msec,  log_dt.log_data[rpt].usec );
        
        
        switch(log_dt.log_data[rpt].type ){
            case LOG_DISP_I2C:
                printf("S=%02x,C1=%02x,C2=%02x,BF=%02x ", 
                        log_dt.log_data[rpt].reg[0],
                        log_dt.log_data[rpt].reg[1],
                        log_dt.log_data[rpt].reg[2],
                        log_dt.log_data[rpt].reg[3]);
                break;
            case LOG_DISP_I2C_STAT:
                 printf("S=%d ", log_dt.log_data[rpt].reg[0]);
                break;
            case LOG_DISP_GET_TM:
                printf("C=%d,index=%d,flg=%d ",log_dt.log_data[rpt].reg[0],log_dt.log_data[rpt].reg[1],log_dt.log_data[rpt].reg[2]);
                break;
            case LOG_DISP_SET_TM:
                printf("D=%d,index=%d ",log_dt.log_data[rpt].reg[0],log_dt.log_data[rpt].reg[1]);
                break;
            case LOG_DISP_REL_TM:
                printf("index=%d ",log_dt.log_data[rpt].reg[0]);
                break;
            case LOG_DISP_NO_DATA:
            default:
                break;
        }

        printf("%s\r\n", &log_dt.log_data[rpt].string[0]);
                

        rpt ++;
        if( rpt > LOG_SIZE ){
            rpt = 0;
        }
        if( rpt == log_dt.wpt ){
            break;
        }
    }
     
 }
 
 
 
//-----------------------------------------------------------------------------
// 
//-----------------------------------------------------------------------------
void uint2string(char *buf, uint16_t data, uint8_t flg,uint8_t keta)
{
    uint16_t dt;
    uint16_t i;
    uint16_t sw;
    uint16_t kdt = 1;
    
    sw = 0;
    
    
    dt = data;
    if( flg == 10){
        if( keta == 0 ){
            kdt = 10000;
        }
        else if( keta > 5 ){
                kdt = 10000;
        }
        else {
            for( i=1; i< keta; i++ ){
                kdt = kdt * 10;
            }
        }
        
        for(i=10000; i>0; i/=10){
            if( i == kdt )
                sw = 1;
                  
            dt = dt/i;
            if(sw==0){
                if(dt != 0){
                    *buf = CharConv[dt];
                    sw=1;
                }
            }
            else{
                    *buf = CharConv[dt];            
            }
            dt = data - dt*i;
            buf ++;
        }
    }
    else{
        *buf = '0';
        buf ++;
        *buf = 'x';
        buf ++;

        dt = (data >> 12)& 0x0f;
        *buf = CharConv[dt];
        buf ++;
        
        dt = (data >> 8)& 0x0f;
        *buf = CharConv[dt];
        buf ++;
        
        dt = (data >> 4)& 0x0f;
        *buf = CharConv[dt];
        buf ++;
        
        dt = data & 0x0f;
        *buf = CharConv[dt];
        buf ++;
                
    }
    
    *buf =(char) '\0';
    
    
}
#ifdef ___NOP


 //-----------------------------------------------------------------------------
// 
//-----------------------------------------------------------------------------


void print_string(char *string)
{
    while( *string != '\0' ){
        putch(*string);
        string ++;
    }
}

#endif


#ifdef ___NOP 

//-----------------------------------------------------------------------------
// 
//-----------------------------------------------------------------------------
void print_uint16(char *string,uint16_t dt1,uint16_t dt2,uint16_t dt3)
{
    char buf[10];
    uint8_t cnt = 0;
    uint8_t i;
    uint16_t data[3];

    data[0] = dt1;
    data[1] = dt2;
    data[2] = dt3;
    
    while( *string != '\0' ){
        if(( *string == '%' ) && ( cnt < 3 )){
            string ++;
            if( *string == 'd' ){
                uint2string(buf, data[cnt], 0);
                cnt ++;
                for( i=0; 1 < 10; i++ ){
                    if( buf[i] != '\0' ){
                        putch('buf[i]');
                    }
                }
            }
            else if( *string == 'x' ){
                uint2string(buf, data[cnt], 1);
                cnt ++;
                for( i=0; 1 < 10; i++ ){
                    if( buf[i] != '\0' ){
                        putch('buf[i]');
                    }
                }
            }
            else{
                putch('%');
            }
        }

        putch(*string);
        string ++;
    }    
}


#endif
//==============================================================================
//
//==============================================================================
        
 COMMAND_MENUE input2menu(void)
 {
     uint16_t i = 0;
    COMMAND_MENUE rtn = DL_ENDPT;
             
        while( com_list[i].pt != DL_ENDPT ){
            //printf("input=%s,%s \r\n",input_string,&com_list[i].command[0]);
            if (strcmp(&input_string.main[0], &com_list[i].command[0]) == 0){
                
                
                
                rtn = com_list[i].pt;
                break;
            }
            i++;
        }
        
    return rtn;
}

//==============================================================================
//
//==============================================================================
#ifdef _____NOP

void USB_start_dispg(void)
{
    
    Wait2Connect();
    
