Satoru-Kutsuwada/PIC-18F47J53_vl53l0x/PIC18F47J53.X/debug_main.c
    Wait2TxRedy();

    
    printf("\r\n");
    printf("\r\n");
    printf("*******************\r\n");
    putsUSBUSART("\r\n*** USB-CDC Setup ***\r\n");

    printf("*******************\r\n");
    printf("\r\n");

    
    //CDCTxService();
    CDCTxService22();
                    
}
#endif

//==============================================================================
//
//==============================================================================
void uart_start_dispg(void)
{
#ifdef _____NOP
    
    printf("\r\n");
    printf("\r\n");
    printf("*******************\r\n");
#endif

    printf("*** USART Setup ***\r\n");

#ifdef _____NOP
    printf("*******************\r\n");
    printf("\r\n");
#endif

                    
}
//==============================================================================
//
//==============================================================================

void uart485_start_dispg(void)
{
#ifdef _____NOP
    
    printf("\r\n");
    printf("\r\n");
    printf("*******************\r\n");
#endif

    print485("*** USART485 Setup ***\r\n");

#ifdef _____NOP
    printf("*******************\r\n");
    printf("\r\n");
#endif

                    
}
//==============================================================================
//
//==============================================================================
void main_loop_disp(void)
{
    //printf("\r ***** MAIN LOOP START *****\n");


    printf("\r\n");
    printf("Initialize End\r\n\r\n");
    printf(" *     *    *     ***  *   * \r\n");
    printf(" * * * *   * *     *   **  * \r\n");
    printf(" *  *  *  *****    *   * * * \r\n");
    printf(" *     *  *    *   *   *  ** \r\n");
    printf(" *     * *      * ***  *   * \r\n\r\n");

    // Show prompt. 
    printf("PIC> ");

                    
}

//==============================================================================
//
//==============================================================================
void DispMenue(uint8_t type)
{
    uint8_t i;
    if( type==DEB_PROMPT_MODE ){
        printf("PIC> ");
    }
    else{
        for( i=0; i<MenueList[type-1].clumn; i++){
            printf("%s\r\n", &MenueList[type-1].pt[i].name[0]);
        }
    }
}
   

//==============================================================================
//
//==============================================================================


 INPUT_CHAR_STEP read_line_streem(void)
 
{
    char c;
    uint16_t i;
    uint16_t j;
    uint16_t keta;
    uint8_t num;
    uint8_t sub_cnt;
    


    c = (char)getch();
    //c = IntgetChar();
    
    if( c != 0 ){
        
        //printf("Get C = %x\r\n",c,0,0);

        switch(input_char_step){
            case INPUT_INIT:
                //printf("INPUT_INIT\r\n");
                input_pos = 0;
                input_char_step = INPUT_SAVING;
                
           
            case INPUT_SAVING:
                if( isprint(c) && (input_pos <= INPUT_BUF_SIZE - 2)){
                    //printf("INPUT_SAVING 01\r\n");
                    input_string.main[input_pos] = c;
                    input_pos ++;
                    putch(c);
                }
                else if (c == 0x08 && input_pos > 0) {      // Back Space
                    //printf("INPUT_SAVING 02\r\n");
                    input_pos --;
                    printf("\x08 \x08");
                } 
                else if (c == '\r') {
                    //printf("INPUT_SAVING 03\r\n");
                    input_string.main[input_pos] = '\0';
                    printf("\r\n");
                    input_char_step = INPUT_DATA_FIX;
              

                    //++++++++++++++++++++++++++++++++++++
                    // Sub String
                    //++++++++++++++++++++++++++++++++++++
                    sub_cnt = 0;
                    input_string.sub1[0] = '\0';
                    input_string.sub2[0] = '\0';
                    input_string.data1 = 0;
                    input_string.data2 = 0;
                    j=0;
                    for(i=0; i<INPUT_BUF_SIZE ; i++ ){
                         if( input_string.main[i] == '\0' ){
                            switch(sub_cnt){
                            case 0:
                                break;
                            case 1:
                                input_string.sub1[j] = '\0';
                                j++;
                                break;
                            case 2:
                                input_string.sub2[j] = '\0';
                                break;
                            }
                            break;
                         }
                         else if(input_string.main[i]==' '){
                            switch(sub_cnt){
                            case 0:
                                input_string.main[i] = '\0';
                                sub_cnt ++;
                                break;
                            case 1:
                                if( input_string.sub1[0] != '\0'){
                                    input_string.sub1[j] = '\0';
                                    sub_cnt ++;
                                    j=0;
                                }
                                break;
                            case 2:
                                if( input_string.sub2[0] != '\0'){
                                    input_string.sub2[j] = '\0';
                                    //sub_cnt ++;
                                }
                                break;
                            }
                         }
                         else{
                            switch(sub_cnt){
                            case 0:
                                break;
                            case 1:
                                input_string.sub1[j] = input_string.main[i] ;
                                j++;
                                break;
                            case 2:
                                input_string.sub2[j] = input_string.main[i] ;
                                j++;
                                break;
                            }
                         }
                    }
#ifdef __INPUT_STRING_LOG
    printf("main = %s\r\n", &input_string.main[0]);
    printf("sub1 = %s\r\n", &input_string.sub1[0]);
    printf("sub2 = %s\r\n", &input_string.sub2[0]);
#endif

                    SetSubStringData( &input_string.sub1[0],&input_string.data1);
                    SetSubStringData( &input_string.sub2[0],&input_string.data2);



                    

