Satoru-Kutsuwada/PIC-18F47J53_vl53l0x/PIC18F47J53.X/debug_main.c
                }
            default:
                break;              
        }
    }
    //printf("read_line_streem\r\n");
    return(input_char_step);
 }

//==============================================================================
//
//==============================================================================
 
void SetSubStringData( char *cpt, uint16_t *dpt )
{
    uint8_t i;
    uint8_t  num = 1;
    uint16_t keta = 0;
    *dpt = 0;

#ifdef __INPUT_STRING_LOG
    printf("Input sub = %s\r\n",cpt);
#endif
    if(( cpt[0] == '0') && ( cpt[1] == 'x')){
        for(i=2; i<INPUT_BUF_SIZE/2; i++ ){
            if(cpt[i]=='\0'){
                break;
            }
            /* アルファベットか数字かを判定 */
            if((cpt[i] >='a' &&  cpt[i]<='f')||(cpt[i]>='A' && cpt[i]<='F')||(cpt[i]>='0'&& cpt[i]<='9')){
                if(keta == 0){
                    keta = 1;
                }
                else{
                    keta *= 16;
                }
            }
            else{
                num = 0;
                break;
            }
        }
        
#ifdef __INPUT_STRING_LOG
        printf("num=%d,keta=0x%x\r\n",num,keta);
#endif
        if( num == 1){
            for(i=2; i<INPUT_BUF_SIZE/2; i++ ){
                if(cpt[i]=='\0'){
                    break;
                }
                else{
                    if(cpt[i]>='0'&& cpt[i]<='9'){
                        *dpt += (cpt[i] & 0x0f)*keta;
                    }
                    else{
                        *dpt += ((cpt[i] & 0x0f)+9)*keta;
                    }
                    keta /= 16;
                }
            }
        }
#ifdef __INPUT_STRING_LOG
        printf("*dpt=0x%x\r\n",*dpt);
#endif
    }
    else{
        for(i=0; i<INPUT_BUF_SIZE/2; i++ ){
            if(cpt[i]=='\0'){
                break;
            }
            /* 数字かを判定 */
            if(cpt[i]>='0'&& cpt[i]<='9'){
                if(keta == 0){
                    keta = 1;
                }
                else{
                    keta *= 10;
                }
            }
            else{
                num = 0;
                break;
            }
        }

#ifdef __INPUT_STRING_LOG
        printf("num=%d,keta=%d\r\n",num,keta);
#endif
        if( num == 1){
            for(i=0; i<INPUT_BUF_SIZE/2; i++ ){
                if(cpt[i]=='\0'){
                    break;
                }
                else{
                    *dpt += (cpt[i] & 0x0f)*keta;
                    keta /= 10;
                }
            }
        }
#ifdef __INPUT_STRING_LOG
        printf("*dpt=%d\r\n",*dpt);
#endif
    }
}
 //==============================================================================
//
//==============================================================================
 void debug_main485(void)
 {
     char c;

     c = (char )getch485();
     if( c != 0 ){
         printf("RS485 C=0x%x\r\n",c);
         if( c == '9'){
            putch485('O');
            putch485('K');
            putch485('\r');
            putch485('\n');
         }
     }

 }           

//==============================================================================
//
//==============================================================================
 void debug_main(void)
 {
     uint8_t i;
     
     if(read_line_streem() == INPUT_DATA_FIX){
            input_char_step = INPUT_INIT;
            
            
            if (strcmp(&input_string.main[0], "") != 0){

                if( dev_menue_type == DEB_VL53_MENUE ){
                    switch( input_string.main[0] ){
                        case '1':
                            VL53_init();
                            break;
                        case '2':
                            //vl53l0x_test();
                            vl53l0x_Racing_test( RASING_MODE_CONTINUE );
                            break;
                        case '3':
                            //vl53l0x_Single_test();
                            vl53l0x_Racing_test( RASING_MODE_SINGLE );
                            break;
                        case '4':
                            //vl53l0x_SingleHA_test();
                            vl53l0x_Racing_test( RASING_MODE_SINGLE_HA );
                            break;
                        case '5':
                            //vl53l0x_SingleHS_test();
                            vl53l0x_Racing_test( RASING_MODE_SINGLE_HS );
                            break;
                        case '6':
                            //vl53l0x_SingleLR_test();
                            vl53l0x_Racing_test( RASING_MODE_SINGLE_LR );
                            break;
                        case '7':
                            vl53data_disp();
                              break;
                        case '8':
                            break;
                        case '9':
                            break;
                        case 'r':
                        case 'R':
                            dev_menue_type = DEB_PROMPT_MODE;  
//                            DispMenue(dev_menue_type); 
                        
                        
                        default:
                            break;
                    }
                }
                else if( dev_menue_type == DEB_RS485_MENUE ){
                    switch( input_string.main[0] ){
                        case '1':
                            break;
                        case '2':
                            vl53l0x_Racing_test( RASING_MODE_CONTINUE );
                            break;
                        case 'r':
                        case 'R':
                            dev_menue_type = DEB_PROMPT_MODE;     
                        default:
                            break;
                    }
                }
                else{
                    switch( input2menu() ){
                    case DL_RTC:
                        //RTCdisp();
                        rtc_disp_log(1);
                        break;
                    case DL_REG:
                        RegiDisp();
                        break;           
                    case DL_I2C:
                        // Clock 変更  i2c -c 100
                        if( input_string.sub1[0]=='-' && input_string.sub1[1]=='c' ){
                            if(input_string.data2 == 100){
                                printf("SCL 100KHz\r\n");
                                i2c_init(0);
                            }
                            else{
                                printf("SCL 400KHz\r\n");
                                i2c_init(1);
                            }
                        }
                        else{
                            if(input_string.data1 == 0){
                                i2c_sens_cnt = 1;
                            }
                            else{
                                i2c_sens_cnt = input_string.data1;
                            }
                        }
                        break;           
                    case DL_VL53:
                        
                        dev_menue_type = DEB_VL53_MENUE;
                         //DispMenue(dev_menue_type ); 
                        
                        break;
                    case DL_RS485:
                        dev_menue_type = DEB_RS485_MENUE;
                        break;
                        
                    case DL_PB0:
                        if( LATBbits.LATB2 )
                           LATBbits.LATB2 = 0;
                        else
                            LATBbits.LATB2 = 1;
                        break;
                    case DL_LOG:
                        DispLogData();
                        break;
                    case DL_LOGOFF:
                        log_onoff = 0;
                        printf("LOG OFF = %d\r\n",log_onoff);
                        break;
                    case DL_LOGON:
                        log_onoff += 1;
                        printf("LOG ON = %d\r\n",log_onoff);
                        break;
                    case DL_LOGCLEAR:
                        printf("LOG CLEAR\r\n");
                        log_init();
                        set_log_stop(0);
                        break;
                    case DL_ENDPT:
                        printf("Command not found. \r\n");
                        break;
                    default:
                        break;
                    }
                }
            }
                         
            // Show prompt. 
            DispMenue(dev_menue_type);
     }
 }
uint8_t get_log_onoff(void)
{
    return log_onoff;
}
 
