Satoru-Kutsuwada/PIC-18F47J53_vl53l0x/PIC18F47J53.X/debug_main.c
void RegiDisp(void)
{
    uint8_t *pt;
//================================================   
//ポート   
//================================================   

//================================================   
//I2Cモジュール初期化   
//================================================   
printf("\r\n");
printf("*** I2C ************\r\n");
printf(" SSP1STAT = 0x%02x\r\n",  SSP1STAT);
printf(" SSP1CON1 = 0x%02x\r\n",  SSP1CON1);
printf(" SSP1CON2 = 0x%02x\r\n",  SSP1CON2);
printf(" SSP1ADD  = 0x%02x\r\n\n",  SSP1ADD);
printf(" SSP2STAT = 0x%02x\r\n",  SSP2STAT);
printf(" SSP2CON1 = 0x%02x\r\n",  SSP2CON1);
printf(" SSP2CON2 = 0x%02x\r\n",  SSP2CON2);
printf(" SSP2ADD  = 0x%02x\r\n\n",  SSP2ADD);

printf("*** PORT ************\r\n");
printf(" TRISA  = 0x%02x\r\n",  TRISA);
printf(" TRISB  = 0x%02x\r\n",  TRISB);
printf(" TRISC  = 0x%02x\r\n",  TRISC);
printf(" TRISD  = 0x%02x\r\n",  TRISD);
printf(" TRISE  = 0x%02x\r\n\n",  TRISE);

printf("*** OSCILLATOR ************\r\n");
printf(" OSCCON  = 0x%02x\r\n",  OSCCON);
printf(" OSCCON2 = 0x%02x\r\n",  OSCCON2);
printf(" OSCTUNE = 0x%02x\r\n\n",  OSCTUNE);

printf("*** INTERRUPT ************\r\n");
printf(" RCON    = 0x%02x\r\n",  RCON );
printf(" INTCON  = 0x%02x\r\n",  INTCON );
printf(" INTCON2 = 0x%02x\r\n",  INTCON2 );
printf(" INTCON3 = 0x%02x\r\n",  INTCON3 );
printf(" PIR     = 0x%02x, 0x%02x, 0x%02x, 0x%02x, 0x%02x\r\n",  PIR1,PIR2,PIR3,PIR4,PIR5 );
printf(" PIE     = 0x%02x, 0x%02x, 0x%02x, 0x%02x, 0x%02x\r\n",  PIE1,PIE2,PIE3,PIE4,PIE5 );
printf(" IPR     = 0x%02x, 0x%02x, 0x%02x, 0x%02x, 0x%02x\r\n",  IPR1,IPR2,IPR3,IPR4,IPR5 );

printf("\n*** UART1 ************\r\n");
printf(" TXSTA1    = 0x%02x\r\n",  TXSTA1 );
printf(" RCSTA1    = 0x%02x\r\n",  RCSTA1 );
printf(" BAUDCON1  = 0x%02x\r\n",  BAUDCON1 );
printf(" SPBRG1    = 0x%02x%02x\r\n",  SPBRGH1,SPBRG1 );
printf("\n*** UART2 ************\r\n");
printf(" TXSTA2    = 0x%02x\r\n",  TXSTA2 );
printf(" RCSTA3    = 0x%02x\r\n",  RCSTA2 );
printf(" BAUDCON2  = 0x%02x\r\n",  BAUDCON2 );
printf(" SPBRG2    = 0x%02x%02x\r\n",  SPBRGH2,SPBRG2 );




#ifdef ___NOP
printf("*** CONFIG ************\r\n");
pt = (uint8_t *)0x1FFF8;
printf(" CONFIG1L  = 0x%x\r\n",  *pt);
pt = (uint8_t *)0x1FFF9;
printf(" CONFIG1H  = 0x%x\r\n",  *pt);
pt = (uint8_t *)0x1FFFA;
printf(" CONFIG2L  = 0x%x\r\n",  *pt);
pt = (uint8_t *)0x1FFFB;
printf(" CONFIG2H  = 0x%x\r\n",  *pt);
#endif


#ifdef _____NOP
print_uint16(" ADCON1 = 0x%x\r\n",  ADCON1 ,0,0);
print_uint16(" TRISA  = 0x%x\r\n",  TRISA  ,0,0);
print_uint16(" TRISB  = 0x%x\r\n",  TRISB  ,0,0);
print_uint16(" TRISC  = 0x%x\r\n",  TRISC  ,0,0);
print_uint16(" TRISD  = 0x%x\r\n",  TRISD  ,0,0);
print_uint16(" TRISE  = 0x%x\r\n\n",  TRISE  ,0,0);
print_uint16(" LATA   = 0x%x\r\n",  LATA  ,0,0);
print_uint16(" LATB   = 0x%x\r\n",  LATB  ,0,0);
print_uint16(" LATC   = 0x%x\r\n",  LATC  ,0,0);
print_uint16(" LATD   = 0x%x\r\n",  LATD  ,0,0);
print_uint16(" LATE   = 0x%x\r\n\n",  LATE  ,0,0);
//================================================   
//USART   
//================================================   
print_uint16(" BRGH    = 0x%x\r\n",  BRGH  ,0,0);
print_uint16(" SPBRG   = 0x%x\r\n",  SPBRG  ,0,0);
print_uint16(" SYNC    = 0x%x\r\n",  SYNC  ,0,0);
print_uint16(" SPEN    = 0x%x\r\n",  SPEN  ,0,0);
print_uint16(" CREN    = 0x%x\r\n",  CREN  ,0,0);
print_uint16(" TXEN    = 0x%x\r\n\n",  TXEN  ,0,0);
//================================================   
//I2Cモジュール初期化   
//================================================   
print_uint16(" SSPSTAT = 0x%x\r\n",  SSPSTAT  ,0,0);
print_uint16(" SSPCON1 = 0x%x\r\n",  SSPCON1  ,0,0);
print_uint16(" SSPCON2 = 0x%x\r\n",  SSPCON2  ,0,0);
print_uint16(" SSPADD  = 0x%x\r\n\n",  SSPADD  ,0,0);
//================================================   
//OSCILLATOR_Initialize   
//================================================   
print_uint16(" OSCCON  = 0x%x\r\n",  OSCCON  ,0,0);
print_uint16(" OSCTUNE = 0x%x\r\n\n",  OSCTUNE  ,0,0);
print_uint16(" TMR1L   = 0x%x\r\n",  TMR1L  ,0,0);
print_uint16(" TMR1H   = 0x%x\r\n",  TMR1H  ,0,0);
print_uint16(" INTCON  = 0x%x\r\n",  INTCON  ,0,0);
print_uint16(" IPR1    = 0x%x\r\n",  IPR1  ,0,0);
print_uint16(" T1CON   = 0x%x\r\n",  T1CON ,0,0 );
print_uint16(" RCON    = 0x%x\r\n",  RCON ,0,0 );
print_uint16(" INTCON2 = 0x%x\r\n",  INTCON2 ,0,0 );
print_uint16(" INTCON3 = 0x%x\r\n",  INTCON3 ,0,0 );
print_uint16(" PIR1    = 0x%x\r\n",  PIR1 ,0,0 );
print_uint16(" PIR2    = 0x%x\r\n",  PIR2 ,0,0 );
print_uint16(" PIE1    = 0x%x\r\n",  PIE1 ,0,0 );
print_uint16(" PIE2    = 0x%x\r\n",  PIE2 ,0,0 );
print_uint16(" IPR2    = 0x%x\r\n",  IPR2 ,0,0 );
#endif  // _____NOP
}
 
 
 
 

 
